In [1]:
import pandas as pd

In [2]:
df1 = pd.DataFrame({
    "city": ["new york","chicago","orlando"],
    "temperature": [21,14,35],
})
df1

       city  temperature
0  new york           21
1   chicago           14
2   orlando           35

In [3]:
df2 = pd.DataFrame({
    "city": ["chicago","new york","orlando"],
    "humidity": [65,68,75],
})
df2

       city  humidity
0   chicago        65
1  new york        68
2   orlando        75

In [4]:
df3 = pd.merge(df1,df2)
df3

       city  temperature  humidity
0  new york           21        68
1   chicago           14        65
2   orlando           35        75

In [5]:
df4 = pd.DataFrame({
    "city": ["new york","chicago","San "],
    "temperature": [21,14,35],
})
df4

       city  temperature
0  new york           21
1   chicago           14
2      San            35

In [9]:
df5 = pd.merge(df1,df4, how='left')
df5

       city  temperature
0  new york           21
1   chicago           14
2   orlando           35

In [10]:
df5 = pd.merge(df1,df4, how='outer')
df5

       city  temperature
0  new york           21
1   chicago           14
2   orlando           35
3      San            35

In [11]:
df5 = pd.merge(df1,df4, how='right')
df5

       city  temperature
0  new york           21
1   chicago           14
2      San            35